astb_relise/src/Documents/УстановкаСоответствийНоменклатурыВыдачи/УстановкаСоответствийНоменклатурыВыдачи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УстановкаСоответствийНоменклатурыВыдачи</name>
  <registerRecords>InformationRegister.СоответствияНоменклатурыВыдачи</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СоздательДокумента</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Соответствия</name>
    <attributes>
      <name>НоменклатураНормы</name>
      <type>
        <types>CatalogRef.НоменклатураНормОрганизации</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.Подразделения</types>
      </type>
    </attributes>
    <attributes>
      <name>Должность</name>
      <type>
        <types>CatalogRef.ДолжностиИПрофессии</types>
      </type>
    </attributes>
    <attributes>
      <name>УсловиеСоответствия</name>
      <type>
        <types>CatalogRef.ЗащитныеСвойства</types>
        <types>CatalogRef.ГОСТы</types>
        <types>String</types>
        <types>CatalogRef.ДолжностиИПрофессии</types>
        <types>CatalogRef.ВидыСИЗ</types>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Приоритет</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Использовать</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

astb_relise/src/Documents/УстановкаСоответствийНоменклатурыВыдачи/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ЗаполнитьТаблицуДокументаНаСервере(ВариантЗаполнения)
	
	Документы.УстановкаСоответствийНоменклатурыВыдачи.ЗаполнитьТаблицуДокумента(Объект,ВариантЗаполнения);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлажки(Команда)
	
	ИзменитьФлажкиНаСервере(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлажки(Команда)
	
	ИзменитьФлажкиНаСервере(Ложь);
	
КонецПроцедуры

&НаСервере
Процедура ИзменитьФлажкиНаСервере(ЗначениеФлажка)
	
	Документ = РеквизитФормыВЗначение("Объект");
	
	ТаблицаДокумента = Документ.Соответствия.Выгрузить();
	ТаблицаДокумента.ЗаполнитьЗначения(ЗначениеФлажка, "Использовать");
	Документ.Соответствия.Загрузить(ТаблицаДокумента);
	
	ЗначениеВРеквизитФормы(Документ,"Объект");
	
КонецПроцедуры

&НаКлиенте
Процедура СоответствияПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	ТекущиеДанные = Элементы.Соответствия.ТекущиеДанные;
	                          
	Если Копирование Тогда
		Элемент.РежимВводаСтрок = РежимВводаСтрокТаблицы.ПослеТекущейСтроки;		
	Иначе
		Элемент.РежимВводаСтрок = РежимВводаСтрокТаблицы.ВКонецСписка;		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СоответствияПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если Копирование Тогда
		Элемент.ТекущиеДанные.Приоритет = 0;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоТекущемуСостоянию(Команда)
	
	ЗаполнитьТаблицуДокументаНаСервере("ПоБазе");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоНеЗаданным(Команда)
	
	ЗаполнитьТаблицуДокументаНаСервере("ПоПустым");
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоОтсутствующейНоменклатуреНаСервере(МассивПоставщиков)
	
	Документы.УстановкаСоответствийНоменклатурыВыдачи.ЗаполнитьПоОтсутствующейНоменклатуре(Объект,МассивПоставщиков);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоОтсутствующейНоменклатуре(Команда)
	
	ПараметрыФормыВыбора = Новый Структура;
	ПараметрыФормыВыбора.Вставить("РежимОткрытияОкна",  РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	ПараметрыФормыВыбора.Вставить("РежимВыбора",        Истина);
	ПараметрыФормыВыбора.Вставить("ЗакрыватьПриВыборе", Истина);
	ПараметрыФормыВыбора.Вставить("МножественныйВыбор", Истина);
	
	ОткрытьФорму("Справочник.Контрагенты.Форма.ФормаВыбора",ПараметрыФормыВыбора,ЭтаФорма,УникальныйИдентификатор,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ИсточникВыбора.ИмяФормы = "Справочник.Контрагенты.Форма.ФормаВыбора" Тогда
		
		Если ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
			
			ЗаполнитьПоОтсутствующейНоменклатуреНаСервере(ВыбранноеЗначение);
			
		КонецЕсли;
		
	//+++АСТБ_Горюшин_Алексей_23718
	ИначеЕсли ИсточникВыбора.ИмяФормы = "Справочник.НоменклатураНормОрганизации.Форма.ФормаВыбора" Тогда
		
		Если ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
			
			ЗаполнитьПоНоменклатуреНормыНаСервере(ВыбранноеЗначение);
			
		КонецЕсли;
		
	ИначеЕсли ИсточникВыбора.ИмяФормы = "Справочник.Номенклатура.Форма.ФормаВыбора" Тогда
		
		Если ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
			
			ЗаполнитьПоНоменклатуреВыдачиНаСервере(ВыбранноеЗначение);
			
		КонецЕсли;	
	//---АСТБ_Горюшин_Алексей_23718
		
	КонецЕсли;
	
КонецПроцедуры

//+++АСТБ_Горюшин_Алексей_23718
&НаКлиенте
Процедура ЗаполнитьПоНоменклатуреНормы(Команда)
	
	ПараметрыФормыВыбора = Новый Структура;
	ПараметрыФормыВыбора.Вставить("РежимОткрытияОкна",  РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	ПараметрыФормыВыбора.Вставить("РежимВыбора",        Истина);
	ПараметрыФормыВыбора.Вставить("ЗакрыватьПриВыборе", Истина);
	ПараметрыФормыВыбора.Вставить("МножественныйВыбор", Истина);
	ПараметрыФормыВыбора.Вставить("Отбор",              Новый Структура("Владелец", Объект.Организация));
	
	ОткрытьФорму("Справочник.НоменклатураНормОрганизации.ФормаВыбора",ПараметрыФормыВыбора,ЭтаФорма,УникальныйИдентификатор,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры //---АСТБ_Горюшин_Алексей_23718

//+++АСТБ_Горюшин_Алексей_23718
&НаСервере
Процедура ЗаполнитьПоНоменклатуреНормыНаСервере(СписокНоменклатурыНорм)
	
	Документы.УстановкаСоответствийНоменклатурыВыдачи.ЗаполнитьТаблицуДокумента(Объект,"ПоНоменклатуреНормы",СписокНоменклатурыНорм);
	
	Модифицированность = Истина;
	
КонецПроцедуры //---АСТБ_Горюшин_Алексей_23718

//+++АСТБ_Горюшин_Алексей_23718
&НаКлиенте
Процедура ЗаполнитьПоНоменклатуреВыдачи(Команда)
	
	ПараметрыФормыВыбора = Новый Структура;
	ПараметрыФормыВыбора.Вставить("РежимОткрытияОкна",  РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	ПараметрыФормыВыбора.Вставить("РежимВыбора",        Истина);
	ПараметрыФормыВыбора.Вставить("ЗакрыватьПриВыборе", Истина);
	ПараметрыФормыВыбора.Вставить("МножественныйВыбор", Истина);
	
	ОткрытьФорму("Справочник.Номенклатура.ФормаВыбора",ПараметрыФормыВыбора,ЭтаФорма,УникальныйИдентификатор,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
КонецПроцедуры //---АСТБ_Горюшин_Алексей_23718

//+++АСТБ_Горюшин_Алексей_23718
&НаСервере
Процедура ЗаполнитьПоНоменклатуреВыдачиНаСервере(СписокНоменклатурыВыдачи)
	
	Документы.УстановкаСоответствийНоменклатурыВыдачи.ЗаполнитьТаблицуДокумента(Объект,"ПоНоменклатуреВыдачи",СписокНоменклатурыВыдачи);
	
	Модифицированность = Истина;
	
КонецПроцедуры //---АСТБ_Горюшин_Алексей_23718


//+++АСТБ_Горюшин_Алексей_23718
// На форму добавлены команды ЗаполнитьПоНоменклатуреНормы и ЗаполнитьПоНоменклатуреВыдачи
// и кнопки СоответствияЗаполнитьПоНоменклатуреНормы и СоответствияЗаполнитьПоНоменклатуреВыдачи
//---АСТБ_Горюшин_Алексей_23718
